Revit 2027 API
RebarCrankOverridableParameters.GetCrankStartRatioFormulaParams Method
 Gets the formula parameter ids defined in the RebarShape family which are associated with start crank ratio parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetCrankStartRatioFormulaParams()
Public Function GetCrankStartRatioFormulaParams As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetCrankStartRatioFormulaParams()
member GetCrankStartRatioFormulaParams : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 Returns the formula parameter ids defined in the RebarShape family which are associated with start crank ratio parameters.
See Also
Reference
RebarCrankOverridableParameters Class
Autodesk.Revit.DB.Structure Namespace